app/controllers/movies_controller.rb

  def index
    sort = params[:sort] || session[:sort]
    case sort
    when 'title'
      ordering, @title_header = {:order => :title}, 'hilite'
    when 'release_date'
      ordering, @date_header = {:order => :release_date}, 'hilite'
    end
    @movies = Movie.find(:all, :order => sort ? sort : id)
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "title"]]